import time
import os

# ƒ - spawn (marks)
# ₩ - village (marks)
# ʘ - exit (marks)
# ₲ - Boss (marks)
# * - Wall | Player cen't go


layerMapGUI_1 = [
    "               *****************               ",
    "          ****        \          ****          ",
    "       ***             \              ***       ",
    "     **                 \___   ʘ         **     ",
    "    *                       \              *    ",
    "   *                         \              *   ",
    "  *                           \              *  ",
    " *     ₲                       \   ___________* ",
    " *                              \ /           * ",
    "*                                Y             *",
    "*                               /              *",
    "*                              /               *",
    "*                             /       ₩        *",
    "*                            /                 *",
    " *                          /                 * ",
    " *———————ɿ              ___ɺ__________________* ",
    "  *       ‾\___________/                     *  ",
    "   *                                        *   ",
    "    *                                      *    ",
    "     **                                  **     ",
    "       ***                            ***       ",
    "          ****                    ****          ",
    "               ******************               "
]

class layer1():
    Name = ""
    XSpawn, YSpawn = 25, 19  # Координаты точки спауна (ƒ)
    XSettlements, YSettlements = 38, 12  # Координаты первого поселения (₩)
    XBoss, YBoss = 7, 7  # Координаты босса (₲)
    XExit, YExit = 31, 3  # Координаты выхода (ʘ)

    XDungen = [XSpawn, XSettlements, XBoss, XExit]
    YDungen = [YSpawn, YSettlements, YBoss, YExit]

    monsterMax = 87

settlementMapGUI_1 = [
    "              *******************              ",#ʊ - кузнец
    "          ****      |     |      ****          ",#å - алхимик
    "       ***          |     |          ***       ",#Æ - церковь
    "     **       ʚ   ɤ |     |             **     ",#ĉ - рун маг
    "    *    ʚ          |     |               *    ",#ɤ - ничего
    "   *                |     |    ɓɓɓɓɓɓɓɓ    *   ",#ʚ - жилой дом
    "  *         ɤ       |     |    ɓɓɓɓɓɓɓɓ     *  ",#ɓ - поля
    " *                  |     |    ɓɓɓɓɓɓɓɓ      * ",#ʣ - гильдия авантюристов
    " *       ʚ   ʚ      |     |                  * ",
    "*                  ĉ       ʣ    ɓɓɓɓɓɓɓɓ      *",
    "*  ʚ                            ɓɓɓɓɓɓɓɓ      *",
    "*      ʚ          ʊ         Æ    ɓɓɓɓɓɓɓɓ     *",
    "*           ʚ                   ɓɓɓɓɓɓɓɓ      *",
    "*                  å       ɤ    ɓɓɓɓɓɓɓɓ      *",
    " *  ɤ               |     |                  * ",
    " *           ʚ      |     |    ɓɓɓɓɓɓɓɓ      * ",
    "  *     ʚ           |     |    ɓɓɓɓɓɓɓɓ     *  ",
    "   *           ɤ    |     |    ɓɓɓɓɓɓɓɓ    *   ",
    "    *               |     |               *    ",
    "     **         ʚ   |     |             **     ",
    "       ***          |     |          ***       ",
    "          ****      |  ƒ  |      ****          ",
    "              *******************              ",
]

class settlement1():
    Name = "Dungard"
    XSpawn, YSpawn = 23, 21
    XAlchemist, YAlchemist = 19, 13
    XBlacksmith, YBlacksmith = 18, 11
    XRuneMage, YRuneMage = 19, 9 
    XChurch, YChurch = 28, 11
    XAdventurersGuild, YAdventurersGuild = 27, 9

    XDungen = [XSpawn, XAlchemist, XBlacksmith, XRuneMage, XChurch, XAdventurersGuild]
    YDungen = [YSpawn, YAlchemist, YBlacksmith, YRuneMage, YChurch, YAdventurersGuild]

settlementMapGUI_2 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]

layerMapGUI_2 = [
    "               ******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                        _________**     ",
    "    *                         /           *    ",
    "   *                         /     ʘ       *   ",
    "  *                         /               *  ",
    " *                  _______/                 * ",
    " *          ₩      /                         * ",
    "*                 /                           *",
    "*                /                            *",
    "*          _____/                             *",
    "*\        /              ƒ                    *",
    "* ‾‾‾\   /                                    *",
    " *    ‾‾‾‾‾‾\                                * ",
    " *           ‾‾‾‾\                           * ",
    "  *               \        /‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾*  ",
    "   *     ₲          Y‾‾‾‾‾‾                *   ",
    "    *               \                     *    ",
    "     **              |                  **     ",
    "       ***           |               ***       ",
    "          ****       |           ****          ",
    "               *****************               ",
]

class layer2():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87


layerMapGUI_3 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer3():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_4 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer4():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_5 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer5():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_6 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer6():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_7 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer7():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_8 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer8():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_9 = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layer9():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)
    XSettlements_1, YSettlements_1 = 12, 8  # Координаты первого поселения (₩)
    XSettlements_2, YSettlements_2 = 26, 19  # Координаты второго поселения (₩)
    XBoss, YBoss = 9, 17  # Координаты босса (₲)
    XExit, YExit = 35, 5  # Координаты выхода (ʘ)
    monsterMax = 87

layerMapGUI_cheatcr = [
    "              *******************              ",
    "          ****                   ****          ",
    "       ***                           ***       ",
    "     **                                 **     ",
    "    *                                     *    ",
    "   *                                       *   ",
    "  *                                         *  ",
    " *                                           * ",
    " *                                           * ",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    "*                                             *",
    " *                                           * ",
    " *                                           * ",
    "  *                                         *  ",
    "   *                                       *   ",
    "    *                                     *    ",
    "     **                                 **     ",
    "       ***                           ***       ",
    "          ****                   ****          ",
    "              *******************              ",
]
class layerCheatcr():
    Name = ""
    XSpawn, YSpawn = 25, 12  # Координаты точки спауна (ƒ)

if __name__ == "__main__":
    def clear():
        os.system("cls")
        
    def play_animation(frames, delay=0.3):
        clear()
        for frame in frames:
            print(frame)
            time.sleep(delay)

    play_animation(layerMapGUI_1, 0.3)
    input()